## Plan result

Show plan for the following directories:

<details><summary>live/dev</summary>


<pre>The stack at live/dev will be processed in the following order for command plan:
Group 1
- Module ./bar/network/vpc</pre>


#### Plan for bar/network/vpc

<pre>
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = (known after apply)
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "application_name" = "bar"
          + "environment"      = "development"
          + "managed_by"       = "terraform"
          + "name"             = "cloudwatch-log-group-bar-app-dev"
          + "team_owner"       = "bar-team"
        }
      + tags_all          = {
          + "application_name" = "bar"
          + "environment"      = "development"
          + "managed_by"       = "terraform"
          + "name"             = "cloudwatch-log-group-bar-app-dev"
          + "team_owner"       = "bar-team"
        }
    }

  # aws_eip.this will be created
  + resource "aws_eip" "this" {
      + allocation_id             = (known after apply)
      + arn                       = (known after apply)
      + associate_with_private_ip = "192.169.1.10"
      + association_id            = (known after apply)
      + carrier_ip                = (known after apply)
      + customer_owned_ip         = (known after apply)
      + domain                    = (known after apply)
      + id                        = (known after apply)
      + instance                  = (known after apply)
      + ipam_pool_id              = (known after apply)
      + network_border_group      = (known after apply)
      + network_interface         = (known after apply)
      + private_dns               = (known after apply)
      + private_ip                = (known after apply)
      + ptr_record                = (known after apply)
      + public_dns                = (known after apply)
      + public_ip                 = (known after apply)
      + public_ipv4_pool          = (known after apply)
      + tags                      = {
          + "application_name" = "bar"
          + "environment"      = "development"
          + "managed_by"       = "terraform"
          + "name"             = "eip-bar-app-dev"
          + "team_owner"       = "bar-team"
        }
      + tags_all                  = {
          + "application_name" = "bar"
          + "environment"      = "development"
          + "managed_by"       = "terraform"
          + "name"             = "eip-bar-app-dev"
          + "team_owner"       = "bar-team"
        }
      + vpc                       = (known after apply)
    }

  # aws_flow_log.this[0] will be created
  + resource "aws_flow_log" "this" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "application_name" = "bar"
          + "environment"      = "development"
          + "managed_by"       = "terraform"
          + "name"             = "flow-log-bar-app-dev"
          + "team_owner"       = "bar-team"
        }
      + tags_all                 = {
          + "application_name" = "bar"
          + "environment"      = "development"
          + "managed_by"       = "terraform"
          + "name"             = "flow-log-bar-app-dev"
          + "team_owner"       = "bar-team"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "flow-log-role-bar-app-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.this[0] will be created
  + resource "aws_iam_role_policy" "this" {
      + id          = (known after apply)
      + name        = "flow-log-policy-bar-app-dev"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_internet_gateway.this will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "application_name" = "bar"
          + "environment"      = "development"
          + "managed_by"       = "terraform"
          + "name"             = "igw-bar-app-dev"
          + "team_owner"       = "bar-team"
        }
      + tags_all = {
          + "application_name" = "bar"
          + "environment"      = "development"
          + "managed_by"       = "terraform"
          + "name"             = "igw-bar-app-dev"
          + "team_owner"       = "bar-team"
        }
      + vpc_id   = (known after apply)
    }

  # aws_nat_gateway.this will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "application_name" = "bar"
          + "environment"      = "development"
          + "managed_by"       = "terraform"
          + "name"             = "nat-gateway-bar-app-dev"
          + "team_owner"       = "bar-team"
        }
      + tags_all                           = {
          + "application_name" = "bar"
          + "environment"      = "development"
          + "managed_by"       = "terraform"
          + "name"             = "nat-gateway-bar-app-dev"
          + "team_owner"       = "bar-team"
        }
    }

  # aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "application_name" = "bar"
          + "environment"      = "development"
          + "managed_by"       = "terraform"
          + "name"             = "private-route-table-bar-app-dev"
          + "team_owner"       = "bar-team"
        }
      + tags_all         = {
          + "application_name" = "bar"
          + "environment"      = "development"
          + "managed_by"       = "terraform"
          + "name"             = "private-route-table-bar-app-dev"
          + "team_owner"       = "bar-team"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "application_name" = "bar"
          + "environment"      = "development"
          + "managed_by"       = "terraform"
          + "name"             = "public-route-table-bar-app-dev"
          + "team_owner"       = "bar-team"
        }
      + tags_all         = {
          + "application_name" = "bar"
          + "environment"      = "development"
          + "managed_by"       = "terraform"
          + "name"             = "public-route-table-bar-app-dev"
          + "team_owner"       = "bar-team"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private["private-subnet-1"] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private["private-subnet-2"] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public["public-subnet-1"] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.private["private-subnet-1"] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.169.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "application_name" = "bar"
          + "environment"      = "development"
          + "managed_by"       = "terraform"
          + "name"             = "private-subnet-bar-app-dev-1a"
          + "team_owner"       = "bar-team"
        }
      + tags_all                                       = {
          + "application_name" = "bar"
          + "environment"      = "development"
          + "managed_by"       = "terraform"
          + "name"             = "private-subnet-bar-app-dev-1a"
          + "team_owner"       = "bar-team"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private["private-subnet-2"] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.169.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "application_name" = "bar"
          + "environment"      = "development"
          + "managed_by"       = "terraform"
          + "name"             = "private-subnet-bar-app-dev-1c"
          + "team_owner"       = "bar-team"
        }
      + tags_all                                       = {
          + "application_name" = "bar"
          + "environment"      = "development"
          + "managed_by"       = "terraform"
          + "name"             = "private-subnet-bar-app-dev-1c"
          + "team_owner"       = "bar-team"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public["public-subnet-1"] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.169.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "application_name" = "bar"
          + "environment"      = "development"
          + "managed_by"       = "terraform"
          + "name"             = "public-subnet-bar-app-dev-1a"
          + "team_owner"       = "bar-team"
        }
      + tags_all                                       = {
          + "application_name" = "bar"
          + "environment"      = "development"
          + "managed_by"       = "terraform"
          + "name"             = "public-subnet-bar-app-dev-1a"
          + "team_owner"       = "bar-team"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.this will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "192.169.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "application_name" = "bar"
          + "environment"      = "development"
          + "managed_by"       = "terraform"
          + "name"             = "vpc-bar-app-dev"
          + "team_owner"       = "bar-team"
        }
      + tags_all                             = {
          + "application_name" = "bar"
          + "environment"      = "development"
          + "managed_by"       = "terraform"
          + "name"             = "vpc-bar-app-dev"
          + "team_owner"       = "bar-team"
        }
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cloudwatch_log_group_name = (known after apply)
  + flow_log_id               = (known after apply)
  + internet_gateway_id       = (known after apply)
  + nat_gateway_id            = (known after apply)
  + private_subnets           = {
      + private-subnet-1 = {
          + arn                                            = (known after apply)
          + assign_ipv6_address_on_creation                = false
          + availability_zone                              = "us-west-1a"
          + availability_zone_id                           = (known after apply)
          + cidr_block                                     = "192.169.2.0/24"
          + customer_owned_ipv4_pool                       = null
          + enable_dns64                                   = false
          + enable_lni_at_device_index                     = null
          + enable_resource_name_dns_a_record_on_launch    = false
          + enable_resource_name_dns_aaaa_record_on_launch = false
          + id                                             = (known after apply)
          + ipv6_cidr_block                                = null
          + ipv6_cidr_block_association_id                 = (known after apply)
          + ipv6_native                                    = false
          + map_customer_owned_ip_on_launch                = null
          + map_public_ip_on_launch                        = false
          + outpost_arn                                    = null
          + owner_id                                       = (known after apply)
          + private_dns_hostname_type_on_launch            = (known after apply)
          + tags                                           = {
              + application_name = "bar"
              + environment      = "development"
              + managed_by       = "terraform"
              + name             = "private-subnet-bar-app-dev-1a"
              + team_owner       = "bar-team"
            }
          + tags_all                                       = {
              + application_name = "bar"
              + environment      = "development"
              + managed_by       = "terraform"
              + name             = "private-subnet-bar-app-dev-1a"
              + team_owner       = "bar-team"
            }
          + timeouts                                       = null
          + vpc_id                                         = (known after apply)
        }
      + private-subnet-2 = {
          + arn                                            = (known after apply)
          + assign_ipv6_address_on_creation                = false
          + availability_zone                              = "us-west-1b"
          + availability_zone_id                           = (known after apply)
          + cidr_block                                     = "192.169.3.0/24"
          + customer_owned_ipv4_pool                       = null
          + enable_dns64                                   = false
          + enable_lni_at_device_index                     = null
          + enable_resource_name_dns_a_record_on_launch    = false
          + enable_resource_name_dns_aaaa_record_on_launch = false
          + id                                             = (known after apply)
          + ipv6_cidr_block                                = null
          + ipv6_cidr_block_association_id                 = (known after apply)
          + ipv6_native                                    = false
          + map_customer_owned_ip_on_launch                = null
          + map_public_ip_on_launch                        = false
          + outpost_arn                                    = null
          + owner_id                                       = (known after apply)
          + private_dns_hostname_type_on_launch            = (known after apply)
          + tags                                           = {
              + application_name = "bar"
              + environment      = "development"
              + managed_by       = "terraform"
              + name             = "private-subnet-bar-app-dev-1c"
              + team_owner       = "bar-team"
            }
          + tags_all                                       = {
              + application_name = "bar"
              + environment      = "development"
              + managed_by       = "terraform"
              + name             = "private-subnet-bar-app-dev-1c"
              + team_owner       = "bar-team"
            }
          + timeouts                                       = null
          + vpc_id                                         = (known after apply)
        }
    }
  + public_subnets            = {
      + public-subnet-1 = {
          + arn                                            = (known after apply)
          + assign_ipv6_address_on_creation                = false
          + availability_zone                              = "us-west-1a"
          + availability_zone_id                           = (known after apply)
          + cidr_block                                     = "192.169.1.0/24"
          + customer_owned_ipv4_pool                       = null
          + enable_dns64                                   = false
          + enable_lni_at_device_index                     = null
          + enable_resource_name_dns_a_record_on_launch    = false
          + enable_resource_name_dns_aaaa_record_on_launch = false
          + id                                             = (known after apply)
          + ipv6_cidr_block                                = null
          + ipv6_cidr_block_association_id                 = (known after apply)
          + ipv6_native                                    = false
          + map_customer_owned_ip_on_launch                = null
          + map_public_ip_on_launch                        = true
          + outpost_arn                                    = null
          + owner_id                                       = (known after apply)
          + private_dns_hostname_type_on_launch            = (known after apply)
          + tags                                           = {
              + application_name = "bar"
              + environment      = "development"
              + managed_by       = "terraform"
              + name             = "public-subnet-bar-app-dev-1a"
              + team_owner       = "bar-team"
            }
          + tags_all                                       = {
              + application_name = "bar"
              + environment      = "development"
              + managed_by       = "terraform"
              + name             = "public-subnet-bar-app-dev-1a"
              + team_owner       = "bar-team"
            }
          + timeouts                                       = null
          + vpc_id                                         = (known after apply)
        }
    }
  + vpc_id                    = (known after apply)</pre>
</details>